"""
https://www.acmicpc.net/problem/17450
Baekjoon
17450 과자 사기

문제
남서네 집 앞 편의점에는 각각 S, N, U의 이름이 붙은 총 3가지의 과자를 판다. 
진열대에는 한 봉지당 가격과 무게가 안내되어 있다. 
같은 종류의 과자끼리는 봉지의 무게가 똑같다.

남서는 오늘 과자를 10봉지 사려고 한다. 
편의점의 단골인 남서는 할인 쿠폰 하나를 가지고 있는데, 
총 구매 금액이 5,000원 이상일 때 500원을 깎아 주는 쿠폰이다. 
구매 금액이 5,000원 미만인 경우에는 할인 쿠폰을 쓸 수 없다. 
또한 할인을 여러 번 적용할 수는 없다.

남서는 과자를 고를 때 가성비를 중요하게 생각한다. 
남서가 생각하는 가성비란, 총 무게를 총 금액으로 나눈 값이다. 
남서는 빨리 과자가 먹고 싶기 때문에, 한 종류의 과자만을 10봉지 골라 사 가려고 한다. 
또, 다른 물건은 구매하지 않을 생각이다.

가성비를 다시 한 번 수학적으로 표현하면 다음과 같다.
                      과자 10봉지의 무게의 합
가성비 =  -----------------------------------------------
          쿠폰 사용을 고려했을 때 과자 10봉지를 사는 데 필요한 돈

진열대를 들여다 보던 남서는 신기하게도 세 과자의 가성비가 모두 서로 다르다는 사실을 깨달았다.
남서는 어떤 과자를 사게 될까?


입력
입력은 총 3개의 줄로 이루어지며, 
각 줄에는 S, N, U의 순서대로 한 봉지의 가격과 무게가 띄어쓰기를 사이에 두고 주어진다.
모든 입력값은 1 이상 1,000 이하의 정수이다.
세 종류의 과자의 가성비가 서로 다름이 보장된다.


출력
첫 번째 줄에 가장 가성비가 높은 과자의 이름(S 또는 N 또는 U)을 출력한다.


예제 입력 1 
8 5
6 6
7 5
예제 출력 1 
N
"""

import sys

sys.stdin = open("./input.txt")

input = lambda: sys.stdin.readline().rstrip()
sn_list = ["S", "N", "U"]
max_ce = [0, ""]

for i in range(3):
    p, m = map(int, input().split())
    m = 10 * m
    if 10 * p >= 5000:
        p = 10 * p - 500
    else:
        p = 10 * p
    cur_ce = m / p
    if max_ce[0] < cur_ce:
        max_ce[0] = cur_ce
        max_ce[1] = sn_list[i]

print(max_ce[1])
