"""
https://www.acmicpc.net/problem/29720
Baekjoon
29720 그래서 님 푼 문제 수가?

브실이는 하루라도 빨리 대회 출제 자격을 얻기 위해서 
1,000문제 해결을 목표로 매일 문제를 풀고 있다. 
그러다 보니 다른 사람들의 푼 문제 수에 관심이 많다. 
사람들은 “저는 총 1,000문제 이상 해결하려면 하루에 5문제씩 
최소 128일은 더 풀어야 해요”와 같이 자신이 몇 문제를 풀었는지 설명한다. 
브실이는 이 말을 들을 때마다 
상대방이 현재까지 몇 문제를 풀었는지 궁금해서 참을 수 없었다.

브실이를 도와 상대방이 푼 문제 수의 최솟값과 최댓값을 구해보자.


입력
첫 번째 줄에 양의 정수 
N, M, K가 공백으로 구분되어 주어진다. 
(1 <= N, M, K <= 2,000)

이는 “저는 총 
N문제 이상 해결하려면 하루에 
M문제씩 최소 
K일은 더 풀어야 해요”라는 의미이다.

K일이 지나기 전에 
N문제를 해결할 수 있는 입력은 주어지지 않는다.


출력
위 문장으로 알 수 있는 상대방이 현재까지 푼 문제 수의 
최솟값과 최댓값을 공백으로 구분하여 한 줄에 순서대로 출력한다.


예제 입력 1 
1000 5 128
예제 출력 1 
360 364

예제 입력 2 
10 9 2
예제 출력 2 
0 0
"""

import sys

sys.stdin = open("./input.txt")

g, d, p = map(int, input().split())


min_cnt = g - (d * p)
if min_cnt < 0:
    min_cnt = 0
max_cnt = g - (d * (p - 1))
print(f"{min_cnt} {max_cnt-1}")
